app/controllers/formularios_controller.rb

SELECT * FROM `formularios`
---
  def index
    @formularios = Formulario.all

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1)
---
  def show
    @formulario = Formulario.find(params[:id])

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 1)
---
  def exibe
    @formulario = Formulario.find(params[:id])

INSERT INTO `formularios` (`updated_at`, `codigo`, `horario`, `created_at`, `path`) VALUES('2012-07-13 10:44:38', 3794101880, '2012-07-13 10:44:38', '2012-07-13 10:44:38', 'public/horarios/3794101880.txt')
---
  def create
    @formulario = Formulario.new(params[:formulario])
    @formulario.cria_arquivo(@formulario.codigo,@formulario.emite_datahora.strftime("%m/%d/%Y"),@formulario.emite_datahora.strftime("%H:%M:%S"),@formulario.busca_nome)
    if @formulario.save

SELECT * FROM `formularios` WHERE (`formularios`.`id` = 2)
DELETE FROM `formularios` WHERE `id` = 2
---
  def destroy
    @formulario = Formulario.find(params[:id])
    @formulario.destroy