app/controllers/importar_controller.rb

SELECT * FROM `temps`
---
  def index
    @import = Temp.all

SELECT * FROM `temps`
INSERT INTO `inscricaos` (`updated_at`, `nome`, `created_at`, `documento`) VALUES('2012-07-13 10:50:58', ' ARLETE UETUKI LOPES RIBEIRO\n', '2012-07-13 10:50:58', 999123)
---
  def efetivar_importacao
    temp = Temp.all
    temp.each do |f|
      importacao = Inscricao.new
      importacao.documento = f.documento
      importacao.nome = f.nome
      importacao.save